/* eslint-disable */
export function slug(str) {
  str = str.trim();
  str = str.toLowerCase();
  const map = {
    "а": "a",
    "б": "b",
    "в": "v",
    "г": "g",
    "д": "d",
    "е": "e",
    "ё": "yo",
    'ж': 'zh',
    'з': 'z',
    'и': 'i',
    'й': 'y',
    'к': 'k',
    'л': 'l',
    'м': 'm',
    'н': 'n',
    'о': 'o',
    'п': 'p',
    'р': 'r',
    'с': 's',
    'т': 't',
    'у': 'u',
    'ф': 'f',
    'х': 'h',
    'ц': 'ts',
    'ч': 'ch',
    'ш': 'sh',
    'щ': 'shch',
    'ъ': '',
    'ы': 'y',
    'ь': '',
    'э': 'e',
    'ю': 'yu',
    'я': 'ya',
    ' ': '-',
    '_': '-',
    '/': '-',
    '\\': '-',
    '+': '-',
    '=': '-',
    ':': '',
    ';': '',
    '?': '',
    '!': '',
    '@': '',
    '#': '',
    '$': '',
    '%': '',
    '^': '',
    '&': '',
    '*': '',
    '(': '',
    ')': '',
    '[': '',
    ']': '',
    '{': '',
    '}': '',
    '<': '',
    '>': '',
    '|': ''
  };
  str = str.replace(/[а-яё]/g, function(match) {
    return map[match];
  });
  str = str.replace(/[^a-z0-9-]/g, '-');
  str = str.replace(/[-]+/g, '-');
  str = str.replace(/^-|-$/g, '');
  return str;
}